In [2]:
import pandas as pd

In [3]:
data = {
    'Student':['Arun', 'Arun', 'Meena', 'Meena'],
    'Marks': [70, 80, 75, 85]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
print(df)

  Student  Marks
0    Arun     70
1    Arun     80
2   Meena     75
3   Meena     85

In [6]:
df

  Student  Marks
0    Arun     70
1    Arun     80
2   Meena     75
3   Meena     85

TOTAL COUNT

In [7]:
total_count = df['Student'].count()

In [8]:
print(total_count)

4

MEAN

In [12]:
mean_marks = df['Marks'].mean()

In [ ]:
print(mean_marks)

77.5

In [16]:
median_marks = df['Marks'].median()

In [17]:
print(median_marks)

77.5

GROUP BY

In [9]:
total_groups = df.groupby('Student')['Marks'].sum()

In [10]:
print(total_groups)

Student
Arun     150
Meena    160
Name: Marks, dtype: int64